/**Завдання 5. Створіть батьківський клас GeometricFigure, який має порожній
метод для визначення площі getArea() та метод toString() для виведення назви класу.
Створіть 3 класи нащадки Triangle, Square і Circle, які наслідуються від класу
GeometricFigure. Кожен з дочірніх класів має свою реалізацію методу getArea(), для
визначення площі фігури. В конструкторах дочірніх класів передбачити властивості
необхідні для визначення площі фігури, наприклад для кола - радіус r.
Створіть зовнішню функцію handleFigures(figures), яка прийматиме масив об’єктів
дочірніх класів figures, перевірятиме чи об’єкт належить батьківському класу з
урахуванням наслідування, виводитиме назву створеного об’єкту відповідної фігури,
розраховану площу фігури та сумарну площу всіх фігур. Для реалізації функції можете
використати метод reduce(). */

class Square extends GeometricFigure {
    constructor(width, height) {
        super();
        this.width = width;
        this.height = height;
    }

     getArea() {
       return this.width * this.height;
    }
}